In [3]:
import psycopg2
import pandas as pd
import os
from sqlalchemy import create_engine
conn = psycopg2.connect(
    host="localhost",
    database="sales_analysis",
    user="postgres",
    password="omprakash",
    port=5432
)
cur = conn.cursor()
cur.execute("SELECT version();")
print(cur.fetchone())

('PostgreSQL 18.1 on x86_64-windows, compiled by msvc-19.44.35221, 64-bit',)

In [21]:
cur.execute("SELECT datname FROM pg_database;")
print(cur.fetchall())

[('postgres',), ('sales_analysis',), ('template1',), ('template0',)]

In [17]:
import pandas as pd

df = pd.read_excel(r"C:\Users\ompra\OneDrive\Documents\omprakash\sales_tables\orders.xlsx")
df.to_csv(r"C:\Users\ompra\OneDrive\Documents\omprakash\sales_tables\orders.csv", index=False)

In [18]:
base_path = Path(r"C:\Users\ompra\OneDrive\Documents\omprakash\sales_tables")
for file in base_path.glob("*.csv"):
    df = pd.read_csv(file)
    print(f"\nðŸ“„ {file.name}")
    print(df.columns.tolist())

ðŸ“„ customers.csv
['customer_id', 'full_name', 'email', 'phone', 'country', 'signup_date', 'signup_channel', 'loyalty_points']

ðŸ“„ orders.csv
['order_id', 'customer_id', 'order_date', 'status', 'discount_amount', 'tax_amount', 'payment_method', 'shipping_address']

ðŸ“„ order_items.csv
['order_item_id', 'order_id', 'product_id', 'quantity', 'unit_price']

ðŸ“„ payment.csv
['payment_id', 'order_id', 'payment_date', 'payment_amount', 'payment_status', 'payment_type']

ðŸ“„ products.csv
['product_id', 'product_name', 'price', 'category', 'brand', 'created_at', 'updated_at']

In [36]:
conn.rollback()
cur.execute("""
   DROP TABLE IF EXISTS products CASCADE;
""")
conn.commit()

In [38]:
### creating table for customer with primary key customer_id and no forigen key
conn.rollback() # just in case if previous query fails to run we can still exectue a query
cur.execute("""
    CREATE TABLE customers (
    customer_id INT PRIMARY KEY,
    full_name TEXT NOT NULL,
    email TEXT UNIQUE,
    phone TEXT,
    country TEXT,
    signup_date DATE,
    signup_channel TEXT,
    loyalty_points INT DEFAULT 0
);
""")
conn.commit()

In [39]:
### creating table for products with primary key product_id and no forigen key
conn.rollback() # just in case if previous query fails to run we can still exectue a query
cur.execute("""
    CREATE TABLE products (
    product_id INT PRIMARY KEY,
    product_name TEXT NOT NULL,
    price NUMERIC(10,2),
    category TEXT,
    brand TEXT,
    created_at TIMESTAMP,
    updated_at TIMESTAMP
);
""")
conn.commit()

In [40]:
### creating table for orders with primary key order_id and forigen key referencing to customer table
conn.rollback() # just in case if previous query fails to run we can still exectue a query
cur.execute("""
    CREATE TABLE orders (
    order_id INT PRIMARY KEY,
    customer_id INT NOT NULL,
    order_date DATE,
    status TEXT,
    discount_amount NUMERIC(10,2),
    tax_amount NUMERIC(10,2),
    payment_method TEXT,
    shipping_address TEXT,
    FOREIGN KEY (customer_id) REFERENCES customers(customer_id)
);
""")
conn.commit()

In [41]:
### creating table for order_items with primary key order_item_id and forigen key referencing to orders and
### and product table
conn.rollback() # just in case if previous query fails to run we can still exectue a query
cur.execute("""
   CREATE TABLE order_items (
    order_item_id INT PRIMARY KEY,
    order_id INT NOT NULL,
    product_id INT NOT NULL,
    quantity INT,
    unit_price NUMERIC(10,2),
    FOREIGN KEY (order_id) REFERENCES orders(order_id),
    FOREIGN KEY (product_id) REFERENCES products(product_id)
);
""")
conn.commit()

In [42]:
### creating table for payments with primary key payment_id and forigen key referencing to orders
conn.rollback() # just in case if previous query fails to run we can still exectue a query
cur.execute("""
   CREATE TABLE payments (
    payment_id INT PRIMARY KEY,
    order_id INT NOT NULL,
    payment_date DATE,
    payment_amount NUMERIC(10,2),
    payment_status TEXT,
    payment_type TEXT,
    FOREIGN KEY (order_id) REFERENCES orders(order_id)
);
""")
conn.commit()

In [2]:
engine = create_engine(
    "postgresql+psycopg2://postgres:omprakash@localhost:5432/sales_analysis"
)

In [4]:
BASE_PATH=Path(r"C:\Users\ompra\OneDrive\Documents\omprakash\sales_tables")
BASE_PATH

WindowsPath('C:/Users/ompra/OneDrive/Documents/omprakash/sales_tables')

In [43]:
query = """
SELECT table_name
FROM information_schema.tables
WHERE table_schema = 'public'
ORDER BY table_name;
"""
pd.read_sql(query, engine)

    table_name
0    customers
1  order_items
2       orders
3     payments
4     products

In [5]:
df_customer=pd.read_csv(BASE_PATH/"customers.csv")
df_products=pd.read_csv(BASE_PATH/"products.csv")
df_orders=pd.read_csv(BASE_PATH/"orders.csv")
df_order_items=pd.read_csv(BASE_PATH/"order_items.csv")
df_payments=pd.read_csv(BASE_PATH/"payment.csv")

In [48]:
df_customers = pd.read_csv(BASE_PATH / "customers.csv")
df_customers.to_sql(
    "customers",
    engine,
    if_exists="append",
    index=False
)
print("customers loaded")

customers loaded

In [49]:
df_products.to_sql(
    "products",
    engine,
    if_exists="append",
    index=False
)
print("products data loaded")

products data loaded

In [50]:
df_orders=pd.read_csv(BASE_PATH/"orders.csv")
df_orders.to_sql(
    "orders",
    engine,
    if_exists="append",
    index=False
)
print("orders data loaded")

orders data loaded

In [51]:
df_order_items=pd.read_csv(BASE_PATH/"order_items.csv")
df_order_items.to_sql(
    "order_items",
    engine,
    if_exists="append",
    index=False
)
print("order_items data loaded")

order_items data loaded

In [52]:
df_payments=pd.read_csv(BASE_PATH/"payment.csv")
df_payments.to_sql(
    "payments",
    engine,
    if_exists="append",
    index=False
)
print("payments data loaded")

payments data loaded

In [ ]:
########################################################################
########### All the tables are created and loaded into the database
########################################################################

Q1: Retrieve top 5 highest value completed orders (order_id, customer_id, order_amount, order_date)
Q2: List customers with more than 2 orders (customer_id, full_name, total_orders)
Q3: Get customers who never placed an order using LEFT JOIN (customer_id, full_name, signup_date)
Q4: Show most expensive product purchased by each customer (customer_id, product_name, price)
Q5: Find order with largest number of items (order_id, total_items)
Q6: List customers who ordered within 30 days of signup (customer_id, full_name, signup_date, first_order_date, days_difference)
Q7: Count orders per status per country (country, status, order_count)
Q8: Calculate Customer Lifetime Value (customer_id, full_name, total_revenue)
Q9: Identify repeat customers - more than 1 order per month (customer_id, full_name, order_month, monthly_order_count)
Q10: Monthly revenue trend (year, month, total_revenue)
Q11: Most returned products where status=Returned (product_id, product_name, return_count)
Q12: Top 3 revenue-generating categories (category, total_revenue)
Q13: Products frequently bought together - basket analysis (product_id_1, product_id_2, times_bought_together)
Q14: Customer retention - ordered again within 90 days (customer_id, full_name, first_order_date, next_order_date, days_between_orders)
Q15: Net Revenue After Discounts & Tax monthly country-wise (country, year, month, gross_revenue, total_discount, total_tax, net_revenue)
Q16: Discount Sensitivity - customers who only order with discounts (customer_id, full_name, total_orders, discounted_orders)
Q17: First vs Most Recent Purchase Product using ROW_NUMBER (customer_id, first_product_name, last_product_name)
Q18: Revenue Contribution Pareto Analysis - top customers for 80% revenue (customer_id, full_name, customer_revenue, cumulative_revenue, cumulative_percentage)
Q19: Brand Affinity per Customer (customer_id, brand, brand_revenue)
Q20: Payment Failure Impact - orders with failed then successful payment (order_id, customer_id, failed_attempts, successful_payment_date)
Q21: Customer Order Velocity - avg days between orders (customer_id, full_name, total_orders, avg_days_between_orders)

In [53]:
# Q1: Retrieve top 5 highest value completed orders (order_id, customer_id, order_amount, order_date)
q1="""
    SELECT 
        o.order_id, 
        o.customer_id,
        SUM(oi.quantity*oi.unit_price) as order_amount,
        o.order_date
    FROM orders as o
    LEFT JOIN order_items as oi ON oi.order_id=o.order_id
    Where o.status='Completed'
    GROUP BY  o.order_id,o.customer_id,o.order_date
    ORDER BY order_amount DESC
    LIMIT 5
"""
pd.read_sql(q1,engine)

   order_id  customer_id  order_amount  order_date
0       300          301       4994.55  2025-11-18
1       795          796       4987.75  2025-10-04
2        45           46       4846.60  2025-11-03
3       180          181       4833.15  2025-12-18
4        15           16       4760.50  2025-12-03

In [55]:
# Q2: List customers with more than 2 orders (customer_id, full_name, total_orders)
q2="""
    SELECT 
        c.customer_id, 
        c.full_name,
        COUNT(o.order_id) as total_orders
    FROM customers as c
    LEFT JOIN orders as o 
        ON o.customer_id=c.customer_id
    GROUP BY c.customer_id,c.full_name
    HAVING COUNT(o.order_id)>2
"""
pd.read_sql(q2,engine)

Empty DataFrame
Columns: [customer_id, full_name, total_orders]
Index: []

In [56]:
#Q3: Get customers who never placed an order using LEFT JOIN (customer_id, full_name, signup_date)
q3="""
    SELECT 
        c.customer_id,
        c.full_name,
        c.signup_date
    FROM customers as c
    LEFT JOIN orders as o ON c.customer_id=o.customer_id
    WHERE o.order_id is NULL
"""
pd.read_sql(q3,engine)

Empty DataFrame
Columns: [customer_id, full_name, signup_date]
Index: []

In [14]:
df_orders

,order_id,customer_id,order_date,status,discount_amount,tax_amount,payment_method,shipping_address
0,1,2,2025-12-17,Cancelled,60.32,29.05,UPI,Address 1
1,2,3,2025-12-16,Pending,14.12,34.40,NetBanking,Address 2
2,3,4,2025-12-15,Completed,4.90,49.91,COD,Address 3
3,4,5,2025-12-14,Cancelled,91.04,31.18,Card,Address 4
4,5,6,2025-12-13,Pending,12.24,38.86,UPI,Address 5
...,...,...,...,...,...,...,...,...
995,996,997,2025-12-12,Completed,63.92,43.14,Card,Address 996
996,997,998,2025-12-11,Cancelled,85.03,16.36,UPI,Address 997
997,998,999,2025-12-10,Pending,63.40,18.35,NetBanking,Address 998
998,999,1000,2025-12-09,Completed,30.69,45.07,COD,Address 999
999,1000,1,2025-12-08,Cancelled,19.10,17.28,Card,Address 1000

In [17]:
# Q4: Show most expensive product purchased by each customer (customer_id, product_name, price)
# giving most expensive orders which are actually completed
q4="""
    SELECT 
        c.customer_id,
        p.product_name,
        p.price as max_price
    FROM customers as c
    INNER JOIN orders as o on c.customer_id=o.customer_id
    INNER JOIN order_items as oi on oi.order_id=o.order_id
    INNER JOIN products as p on p.product_id=oi.product_id
    WHERE p.price=(
        SELECT Max(p1.price)
        FROM orders as o1
        INNER JOIN order_items as oi1 on oi1.order_id=o1.order_id
        INNER JOIN products as p1 on p1.product_id=oi1.product_id
        WHERE c.customer_id=o1.customer_id
    ) AND o.status='Completed'
    ORDER BY customer_id
"""
pd.read_sql(q4,engine)

     customer_id product_name  max_price
0              4    Product 3     315.16
1              7    Product 6     837.44
2             10    Product 9     489.79
3             13   Product 12     734.79
4             16   Product 15     952.10
..           ...          ...        ...
328          988  Product 987     750.01
329          991  Product 990     912.30
330          994  Product 993     930.27
331          997  Product 996     354.93
332         1000  Product 999     318.47

[333 rows x 3 columns]

In [86]:
# Q5: Find order with largest number of items (order_id, total_items)
q5="""
    SELECT
        o.order_id,
        COUNT(oi.order_item_id) as total_items
    FROM orders as o
    INNER JOIN order_items as oi on oi.order_id=o.order_id
    GROUP BY o.order_id
    ORDER BY COUNT(oi.order_item_id) DESC
    LIMIT 1
"""
pd.read_sql(q5,engine)

   order_id  total_items
0       652            1

In [13]:
# Q6: List customers who ordered within 30 days of signup (customer_id, full_name, signup_date, first_order_date, 
# days_difference)
# data is very inconsistent as there are orders that are ordered before signup date
q6="""
    SELECT
        c.customer_id,
        c.full_name,
        c.signup_date,
        o.order_date as first_order_date,
        (o.order_date-c.signup_date) as days_difference
    FROM customers as c
    INNER JOIN orders as o ON c.customer_id=o.customer_id
    WHERE o.order_date=(
        SELECT
            Min(o1.order_date)
            FROM orders as o1
            WHERE o1.customer_id=c.customer_id
    )
    AND (o.order_date-c.signup_date)<=30
"""
pd.read_sql(q6,engine)

     customer_id     full_name signup_date first_order_date  days_difference
0              2    Customer 2  2025-12-16       2025-12-17                1
1              3    Customer 3  2025-12-15       2025-12-16                1
2              4    Customer 4  2025-12-14       2025-12-15                1
3              5    Customer 5  2025-12-13       2025-12-14                1
4              6    Customer 6  2025-12-12       2025-12-13                1
..           ...           ...         ...              ...              ...
252          807  Customer 807  2025-10-02       2025-09-23               -9
253          808  Customer 808  2025-10-01       2025-09-22               -9
254          809  Customer 809  2025-09-30       2025-09-21               -9
255          810  Customer 810  2025-09-29       2025-09-20               -9
256            1    Customer 1  2025-12-17       2025-12-08               -9

[257 rows x 5 columns]

In [93]:
# Q7: Count orders per status per country (country, status, order_count)
q7="""
    SELECT
        c.country,
        o.status,
        COUNT(o.order_id) as order_count
    FROM orders as o
    INNER JOIN customers as c ON c.customer_id=o.customer_id
    GROUP BY c.country,o.status
    ORDER BY c.country
"""
pd.read_sql(q7,engine)

    country     status  order_count
0   Germany  Completed           83
1   Germany  Cancelled           83
2   Germany    Pending           84
3     India  Completed           84
4     India  Cancelled           83
5     India    Pending           83
6        UK  Completed           83
7        UK    Pending           83
8        UK  Cancelled           84
9       USA  Completed           83
10      USA    Pending           83
11      USA  Cancelled           84

In [58]:
#Q8: Calculate Customer Lifetime Value (customer_id, full_name, total_revenue)
q8="""
    SELECT
        c.customer_id,
        c.full_name,
        COALESCE(SUM(oi.quantity*oi.unit_price)) as total_revenue
    FROM customers as c 
    LEFT JOIN orders as o on o.customer_id=c.customer_id
    LEFT JOIN order_items as oi on oi.order_id=o.order_id
    GROUP BY c.customer_id,c.full_name
    order by c.customer_id
"""
pd.read_sql(q8,engine)

     customer_id      full_name  total_revenue
0              1     Customer 1        4760.00
1              2     Customer 2         425.43
2              3     Customer 3         448.90
3              4     Customer 4         945.48
4              5     Customer 5        3779.16
..           ...            ...            ...
995          996   Customer 996        3342.75
996          997   Customer 997         354.93
997          998   Customer 998        1258.32
998          999   Customer 999        2727.48
999         1000  Customer 1000        1273.88

[1000 rows x 3 columns]

In [59]:
# Q9: Identify repeat customers - more than 1 order per month (customer_id, full_name, order_month, monthly_order_count)
q9="""
    SELECT 
        c.customer_id,
        c.full_name,
        DATE_TRUNC('month',o.order_date) as order_month,
        COUNT(o.order_id) as monthly_order_count
    FROM customers as c
    LEFT JOIN orders as o on c.customer_id=o.customer_id
    GROUP BY c.customer_id,c.full_name,DATE_TRUNC('month',o.order_date)
    HAVING COUNT(o.order_id)>1
"""
pd.read_sql(q9,engine)

Empty DataFrame
Columns: [customer_id, full_name, order_month, monthly_order_count]
Index: []

In [60]:
# Q10: Monthly revenue trend (year, month, total_revenue)
q10="""
    SELECT
        DATE_TRUNC('year',o.order_date) as year,
        DATE_TRUNC('month',o.order_date) as month,
        SUM(oi.quantity*oi.unit_price) as total_revenue
    FROM customers as c
    INNER JOIN orders as o on c.customer_id=o.customer_id
    INNER JOIN order_items as oi on oi.order_id=o.order_id
    GROUP BY DATE_TRUNC('month',o.order_date),DATE_TRUNC('year',o.order_date)
"""
pd.read_sql(q10,engine)

                       year                     month  total_revenue
0 2024-12-31 18:30:00+00:00 2025-09-30 18:30:00+00:00      570734.04
1 2024-12-31 18:30:00+00:00 2025-10-31 18:30:00+00:00      576401.97
2 2024-12-31 18:30:00+00:00 2025-08-31 18:30:00+00:00      216252.11
3 2024-12-31 18:30:00+00:00 2025-11-30 18:30:00+00:00      342316.63

Q14: Customer retention - ordered again within 90 days (customer_id, full_name, first_order_date, next_order_date, days_between_orders)
Q17: First vs Most Recent Purchase Product using ROW_NUMBER (customer_id, first_product_name, last_product_name)
Q18: Revenue Contribution Pareto Analysis - top customers for 80% revenue (customer_id, full_name, customer_revenue, cumulative_revenue, cumulative_percentage)
Q20: Payment Failure Impact - orders with failed then successful payment (order_id, customer_id, failed_attempts, successful_payment_date)
Q21: Customer Order Velocity - avg days between orders (customer_id, full_name, total_orders, avg_days_between_orders)

In [61]:
# Q11: Most returned products where status=Returned (product_id, product_name, return_count)
q11="""
    SELECT
        p.product_id,
        p.product_name,
        COUNT(o.order_id) as return_count
    FROM products as p
    INNER JOIN order_items as oi on oi.product_id=p.product_id
    INNER JOIN orders as o on o.order_id=oi.order_id
    WHERE o.status='Returned'
    GROUP BY p.product_id,p.product_name
"""
pd.read_sql(q11,engine)

Empty DataFrame
Columns: [product_id, product_name, return_count]
Index: []

In [62]:
# Q12: Top 3 revenue-generating categories (category, total_revenue)
q12="""
    SELECT
        p.category,
        SUM(oi.quantity*oi.unit_price) as total_revenue
    FROM products as p
    INNER JOIN order_items as oi ON oi.product_id=p.product_id
    GROUP BY p.category
    ORDER BY total_revenue DESC
    LIMIT 3
"""
pd.read_sql(q12,engine)

      category  total_revenue
0  Electronics      564726.80
1      Grocery      471850.60
2        Books      342287.22

In [66]:
# Q13: Products frequently bought together - basket analysis (product_id_1, product_id_2, times_bought_together)
q13="""
    SELECT
        oi.product_id as product_id_1,
        oi1.product_id as product_id_2,
        COUNT(oi.order_id) as times_bought_together
    FROM order_items as oi
    INNER JOIN order_items as oi1 on oi.order_id=oi1.order_id 
            AND oi.product_id<oi1.product_id
    GROUP BY oi.product_id,oi1.product_id
"""
pd.read_sql(q13,engine)

Empty DataFrame
Columns: [product_id_1, product_id_2, times_bought_together]
Index: []

In [ ]:
# Q14: Customer retention - ordered again within 90 days 
#      (customer_id, full_name, first_order_date, next_order_date, days_between_orders)
q14="""
    with row_rank_table as(SELECT
        c.customer_id,
        c.full_name,
        ROW_NUMBER() (PARTITION BY customers ORDER BY o.order_date) as rn
        LEAD(o.order_date) (PARTITION BY customers ORDER BY o.order_date) as next_order_date
    FROM customers as c
    INNER JOIN orders as o on c.customer_id=o.customer_id)
    SELECT 
        c.customer_id,
        c.full_name,
        rt.rn,
        rt.next_order_date as next_order_date
        (rt.rn-rt.next_order_date) as days_between_orders
    FROM customers as c
    INNER JOIN row_rank_table as rt on rt.customer_id=
"""

In [79]:
# Q15: Net Revenue After Discounts & Tax monthly country-wise (country, year, month, gross_revenue, total_discount, 
#      total_tax, net_revenue)
q15="""
    WITH monthly_revenue as(
        SELECT
            c.country,
            DATE_TRUNC('year',o.order_date) as year,
            DATE_TRUNC('month',o.order_date) as month,
            SUM(o.discount_amount) as total_discount,
            SUM(o.tax_amount) as total_tax,
            SUM(oi.quantity*oi.unit_price) as total_amt
        FROM customers as c
        INNER JOIN orders as o on o.customer_id=c.customer_id
        INNER JOIN order_items as oi on oi.order_id=o.order_id
        GROUP BY c.country,DATE_TRUNC('year',o.order_date),DATE_TRUNC('month',o.order_date)
    )
    SELECT
        m.country,
        m.year,
        m.month,
        m.total_discount,
        m.total_tax,
        m.total_amt-m.total_discount-m.total_tax as net_revenue
    FROM monthly_revenue as m
"""
pd.read_sql(q15,engine)

,country,year,month,total_discount,total_tax,net_revenue
0,USA,2024-12-31 18:30:00+00:00,2025-10-31 18:30:00+00:00,4141.92,1968.71,127804.11
1,India,2024-12-31 18:30:00+00:00,2025-09-30 18:30:00+00:00,4500.96,2257.38,125564.90
2,India,2024-12-31 18:30:00+00:00,2025-10-31 18:30:00+00:00,3861.25,1920.52,141340.68
3,Germany,2024-12-31 18:30:00+00:00,2025-11-30 18:30:00+00:00,2809.13,1419.61,77464.89
4,India,2024-12-31 18:30:00+00:00,2025-08-31 18:30:00+00:00,1514.23,735.07,59377.12
5,USA,2024-12-31 18:30:00+00:00,2025-11-30 18:30:00+00:00,2645.24,1244.36,84648.18
6,India,2024-12-31 18:30:00+00:00,2025-11-30 18:30:00+00:00,2577.75,1483.04,85062.19
7,Germany,2024-12-31 18:30:00+00:00,2025-10-31 18:30:00+00:00,4568.56,1904.08,147172.67
8,UK,2024-12-31 18:30:00+00:00,2025-11-30 18:30:00+00:00,2559.38,1380.77,79022.09
9,UK,2024-12-31 18:30:00+00:00,2025-10-31 18:30:00+00:00,4394.23,1869.21,135456.03
10,UK,2024-12-31 18:30:00+00:00,2025-08-31 18:30:00+00:00,1452.03,815.17,52039.16
11,USA,2024-12-31 18:30:00+00:00,2025-08-31 18:30:00+00:00,1566.65,687.59,49814.62
12,Germany,2024-12-31 18:30:00+00:00,2025-08-31 18:30:00+00:00,970.60,563.22,46716.65
13,Germany,2024-12-31 18:30:00+00:00,2025-09-30 18:30:00+00:00,4610.13,2122.44,152826.82
14,UK,2024-12-31 18:30:00+00:00,2025-09-30 18:30:00+00:00,4134.17,2059.59,141560.57
15,USA,2024-12-31 18:30:00+00:00,2025-09-30 18:30:00+00:00,4271.03,2365.81,124460.24

In [84]:
# Q16: Discount Sensitivity - customers who only order with discounts (customer_id, full_name, total_orders, 
#      discounted_orders)
### IN this query i essentially took first quartile as a threshold to classify an order as a discounted order or not
### and the result i got 750 rows which is 75% of all the orders(1000 rows) which is expected give that each customer
### have placed only single order
q16="""
    WITH discount_threshold AS(
        SELECT
            PERCENTILE_CONT(0.25) WITHIN GROUP (ORDER BY o.discount_amount) as q1_discount
        FROM orders as o
    )
    SELECT
        c.customer_id,
        c.full_name,
        COUNT(o.order_id) as total_orders,
        COUNT(
            CASE 
                WHEN o.discount_amount>dt.q1_discount THEN 1
            END
        )
        FROM customers as c
        INNER JOIN orders as o on c.customer_id=o.customer_id
        CROSS JOIN discount_threshold as dt
        GROUP BY c.customer_id,c.full_name
        HAVING COUNT(o.order_id)=COUNT(
                 CASE 
                     WHEN o.discount_amount>dt.q1_discount THEN 1
                 END
        )
"""
pd.read_sql(q16,engine)

     customer_id     full_name  total_orders  count
0            273  Customer 273             1      1
1             51   Customer 51             1      1
2            951  Customer 951             1      1
3             70   Customer 70             1      1
4            758  Customer 758             1      1
..           ...           ...           ...    ...
745          536  Customer 536             1      1
746          465  Customer 465             1      1
747          449  Customer 449             1      1
748           64   Customer 64             1      1
749           55   Customer 55             1      1

[750 rows x 4 columns]

In [71]:
# Q19: Brand Affinity per Customer (customer_id, brand, brand_revenue)
q19="""
    SELECT
        c.customer_id,
        p.brand,
        SUM(oi.quantity*oi.unit_price) as brand_revenue
    FROM customers as c
    INNER JOIN orders as o on o.customer_id=c.customer_id
    INNER JOIN order_items as oi on oi.order_id=o.order_id
    INNER JOIN products as p on p.product_id=oi.product_id
    GROUP BY c.customer_id,p.brand
    ORDER BY brand_revenue
"""
pd.read_sql(q19,engine)

     customer_id     brand  brand_revenue
0            187   Brand 6         103.25
1            502   Brand 1         106.12
2            717  Brand 16         109.68
3            182   Brand 1         119.02
4            492  Brand 11         119.27
..           ...       ...            ...
995          431  Brand 10        4923.50
996          641   Brand 0        4963.85
997          591  Brand 10        4974.25
998          796  Brand 15        4987.75
999          301   Brand 0        4994.55

[1000 rows x 3 columns]